content/rasam/simple_home_made_rasam_powder.org
#+Title: Simple rasam with home made powder

* 1. Soak

Soak for 10 minutes,

- Small lemon size tamrind
- One tomato

* 2. Making powder

No need to dry roast. Just add the following
to blender and grind them coarsely.

- 1 tsp   black pepper
- 1.5 tsp cumin seeds
- 1 tsp   corriander seeds
- 4 to 5  Fenugreek seeds
- 3       red chilli
- 10      Garlic pods not peeled (Sravani likes only 1)


* 3. Squeeze juice

Squeeze tamrind and tomato juice soaked in
step 1.

* 4. Prepare

4.1. Add oil and make it hot.
4.2. Add the following and fry for 2 minutes.
  - 2 red chilli
  - curry leaves
  - powder from step 2.
  - turmeric powder
4.3. Add juice from step 3 and bring it to boil.
4.4. Simmer for 5 more minutes and turn off the stove.

* 5. Add chopped corriander leaves.
