rasam/simple_home_made_rasam_powder.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple rasam with home made powder</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Simple rasam with home made powder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c53fd3">1. Soak</a></li>
<li><a href="#orgc1a78c1">2. Making powder</a></li>
<li><a href="#orgeff1e2d">3. Squeeze juice</a></li>
<li><a href="#org941865b">4. Prepare</a></li>
<li><a href="#orgd095127">5. Add chopped corriander leaves.</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9c53fd3" class="outline-2">
<h2 id="org9c53fd3">1. Soak</h2>
<div class="outline-text-2" id="text-org9c53fd3">
<p>
Soak for 10 minutes,
</p>

<ul class="org-ul">
<li>Small lemon size tamrind</li>
<li>One tomato</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1a78c1" class="outline-2">
<h2 id="orgc1a78c1">2. Making powder</h2>
<div class="outline-text-2" id="text-orgc1a78c1">
<p>
No need to dry roast. Just add the following
to blender and grind them coarsely.
</p>

<ul class="org-ul">
<li>1 tsp   black pepper</li>
<li>1.5 tsp cumin seeds</li>
<li>1 tsp   corriander seeds</li>
<li>4 to 5  Fenugreek seeds</li>
<li>3       red chilli</li>
<li>10      Garlic pods not peeled (Sravani likes only 1)</li>
</ul>
</div>
</div>


<div id="outline-container-orgeff1e2d" class="outline-2">
<h2 id="orgeff1e2d">3. Squeeze juice</h2>
<div class="outline-text-2" id="text-orgeff1e2d">
<p>
Squeeze tamrind and tomato juice soaked in
step 1.
</p>
</div>
</div>

<div id="outline-container-org941865b" class="outline-2">
<h2 id="org941865b">4. Prepare</h2>
<div class="outline-text-2" id="text-org941865b">
<p>
4.1. Add oil and make it hot.
4.2. Add the following and fry for 2 minutes.
</p>
<ul class="org-ul">
<li>2 red chilli</li>
<li>curry leaves</li>
<li>powder from step 2.</li>
<li>turmeric powder</li>
</ul>
<p>
4.3. Add juice from step 3 and bring it to boil.
4.4. Simmer for 5 more minutes and turn off the stove.
</p>
</div>
</div>

<div id="outline-container-orgd095127" class="outline-2">
<h2 id="orgd095127">5. Add chopped corriander leaves.</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
